wsdl-schema-parser/src/test/resources/wsdls/xmethods/http.__webservices.oorsprong.org_websamples.anagram_anagramservice.wso_WSDL.wsdl

<?xml version="1.0" encoding="UTF-8"?><definitions xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.oorsprong.org/" name="AnagramService" targetNamespace="http://www.oorsprong.org/">  <types>    <xs:schema elementFormDefault="qualified" targetNamespace="http://www.oorsprong.org/">      <xs:complexType name="tLanguage">        <xs:sequence>          <xs:element name="sId" type="xs:string"/>          <xs:element name="sName" type="xs:string"/>          <xs:element name="iAnagrams" type="xs:int"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tAnagrams">        <xs:sequence>          <xs:element name="sWord" type="xs:string"/>          <xs:element name="sAnagrams" type="tns:ArrayOfString"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tAnagramsTest">        <xs:sequence>          <xs:element name="sAnagramWord" type="xs:string"/>          <xs:element name="bCorrect" type="xs:boolean"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tAnagramResult">        <xs:sequence>          <xs:element name="iCorrect" type="xs:int"/>          <xs:element name="iIncorrect" type="xs:int"/>          <xs:element name="iSolutionsStored" type="xs:int"/>          <xs:element name="iSolutionsGiven" type="xs:int"/>          <xs:element name="Anagrams" type="tns:ArrayOftAnagramsTest"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tAddLanguageStatus">        <xs:sequence>          <xs:element name="bSuccess" type="xs:boolean"/>          <xs:element name="sMessageText" type="xs:string"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tNewAnagram">        <xs:sequence>          <xs:element name="sAnagram1" type="xs:string"/>          <xs:element name="sLanguageId1" type="xs:string"/>          <xs:element name="sAnagram2" type="xs:string"/>          <xs:element name="sLanguageId2" type="xs:string"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="tAnagramAddStatus">        <xs:sequence>          <xs:element name="sAnagram1" type="xs:string"/>          <xs:element name="sLanguageId1" type="xs:string"/>          <xs:element name="bWord1Added" type="xs:boolean"/>          <xs:element name="sAnagram2" type="xs:string"/>          <xs:element name="sLanguageId2" type="xs:string"/>          <xs:element name="bWord2Added" type="xs:boolean"/>          <xs:element name="sReason" type="xs:string"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ArrayOfString">        <xs:sequence>          <xs:element name="string" type="xs:string" minOccurs="0" maxOccurs="unbounded" nillable="true"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ArrayOftAnagramsTest">        <xs:sequence>          <xs:element name="tAnagramsTest" type="tns:tAnagramsTest" minOccurs="0" maxOccurs="unbounded" nillable="true"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ArrayOftLanguage">        <xs:sequence>          <xs:element name="tLanguage" type="tns:tLanguage" minOccurs="0" maxOccurs="unbounded" nillable="true"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ArrayOftAnagrams">        <xs:sequence>          <xs:element name="tAnagrams" type="tns:tAnagrams" minOccurs="0" maxOccurs="unbounded" nillable="true"/>        </xs:sequence>      </xs:complexType>      <xs:complexType name="ArrayOfInt">        <xs:sequence>          <xs:element name="int" type="xs:int" minOccurs="0" maxOccurs="unbounded" nillable="true"/>        </xs:sequence>      </xs:complexType>      <xs:element name="Languages">        <xs:complexType>          <xs:sequence/>        </xs:complexType>      </xs:element>      <xs:element name="LanguagesResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="LanguagesResult" type="tns:ArrayOftLanguage"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AnagramChallenge">        <xs:complexType>          <xs:sequence>            <xs:element name="iCharacters" type="xs:int"/>            <xs:element name="sLanguageId" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AnagramChallengeResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="AnagramChallengeResult" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="Anagrams">        <xs:complexType>          <xs:sequence>            <xs:element name="iCharacters" type="xs:int"/>            <xs:element name="sLanguageId" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AnagramsResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="AnagramsResult" type="tns:tAnagrams"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="CheckSolutions">        <xs:complexType>          <xs:sequence>            <xs:element name="sAnagramWord" type="xs:string"/>            <xs:element name="sLanguageId" type="xs:string"/>            <xs:element name="sWordsToTest" type="tns:ArrayOfString"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="CheckSolutionsResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="CheckSolutionsResult" type="tns:tAnagramResult"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="WordCount">        <xs:complexType>          <xs:sequence/>        </xs:complexType>      </xs:element>      <xs:element name="WordCountResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="WordCountResult" type="xs:int"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="WordsPerLanguage">        <xs:complexType>          <xs:sequence>            <xs:element name="sLanguageId" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="WordsPerLanguageResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="WordsPerLanguageResult" type="xs:int"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AddLanguage">        <xs:complexType>          <xs:sequence>            <xs:element name="sLanguageId" type="xs:string"/>            <xs:element name="sLanguageName" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AddLanguageResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="AddLanguageResult" type="tns:tAddLanguageStatus"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="IsAnagram">        <xs:complexType>          <xs:sequence>            <xs:element name="sWord1" type="xs:string"/>            <xs:element name="sWord2" type="xs:string"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="IsAnagramResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="IsAnagramResult" type="xs:boolean"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AddAnagram">        <xs:complexType>          <xs:sequence>            <xs:element name="tsNewAnagram" type="tns:tNewAnagram"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="AddAnagramResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="AddAnagramResult" type="tns:tAnagramAddStatus"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="ListAllAnagrams">        <xs:complexType>          <xs:sequence>            <xs:element name="bShowWordOnce" type="xs:boolean"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="ListAllAnagramsResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="ListAllAnagramsResult" type="tns:ArrayOftAnagrams"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="WordLengths">        <xs:complexType>          <xs:sequence/>        </xs:complexType>      </xs:element>      <xs:element name="WordLengthsResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="WordLengthsResult" type="tns:ArrayOfInt"/>          </xs:sequence>        </xs:complexType>      </xs:element>      <xs:element name="Copyrights">        <xs:complexType>          <xs:sequence/>        </xs:complexType>      </xs:element>      <xs:element name="CopyrightsResponse">        <xs:complexType>          <xs:sequence>            <xs:element name="CopyrightsResult" type="tns:ArrayOfString"/>          </xs:sequence>        </xs:complexType>      </xs:element>    </xs:schema>  </types>  <message name="LanguagesSoapRequest">    <part name="parameters" element="tns:Languages"/>  </message>  <message name="LanguagesSoapResponse">    <part name="parameters" element="tns:LanguagesResponse"/>  </message>  <message name="AnagramChallengeSoapRequest">    <part name="parameters" element="tns:AnagramChallenge"/>  </message>  <message name="AnagramChallengeSoapResponse">    <part name="parameters" element="tns:AnagramChallengeResponse"/>  </message>  <message name="AnagramsSoapRequest">    <part name="parameters" element="tns:Anagrams"/>  </message>  <message name="AnagramsSoapResponse">    <part name="parameters" element="tns:AnagramsResponse"/>  </message>  <message name="CheckSolutionsSoapRequest">    <part name="parameters" element="tns:CheckSolutions"/>  </message>  <message name="CheckSolutionsSoapResponse">    <part name="parameters" element="tns:CheckSolutionsResponse"/>  </message>  <message name="WordCountSoapRequest">    <part name="parameters" element="tns:WordCount"/>  </message>  <message name="WordCountSoapResponse">    <part name="parameters" element="tns:WordCountResponse"/>  </message>  <message name="WordsPerLanguageSoapRequest">    <part name="parameters" element="tns:WordsPerLanguage"/>  </message>  <message name="WordsPerLanguageSoapResponse">    <part name="parameters" element="tns:WordsPerLanguageResponse"/>  </message>  <message name="AddLanguageSoapRequest">    <part name="parameters" element="tns:AddLanguage"/>  </message>  <message name="AddLanguageSoapResponse">    <part name="parameters" element="tns:AddLanguageResponse"/>  </message>  <message name="IsAnagramSoapRequest">    <part name="parameters" element="tns:IsAnagram"/>  </message>  <message name="IsAnagramSoapResponse">    <part name="parameters" element="tns:IsAnagramResponse"/>  </message>  <message name="AddAnagramSoapRequest">    <part name="parameters" element="tns:AddAnagram"/>  </message>  <message name="AddAnagramSoapResponse">    <part name="parameters" element="tns:AddAnagramResponse"/>  </message>  <message name="ListAllAnagramsSoapRequest">    <part name="parameters" element="tns:ListAllAnagrams"/>  </message>  <message name="ListAllAnagramsSoapResponse">    <part name="parameters" element="tns:ListAllAnagramsResponse"/>  </message>  <message name="WordLengthsSoapRequest">    <part name="parameters" element="tns:WordLengths"/>  </message>  <message name="WordLengthsSoapResponse">    <part name="parameters" element="tns:WordLengthsResponse"/>  </message>  <message name="CopyrightsSoapRequest">    <part name="parameters" element="tns:Copyrights"/>  </message>  <message name="CopyrightsSoapResponse">    <part name="parameters" element="tns:CopyrightsResponse"/>  </message>  <portType name="AnagramServiceSoapType">    <operation name="Languages">      <documentation>Get a list of languages (id, name and current number of anagrams) stored in the system</documentation>      <input message="tns:LanguagesSoapRequest"/>      <output message="tns:LanguagesSoapResponse"/>    </operation>    <operation name="AnagramChallenge">      <documentation>Get a word that is part of a set of anagrams by passing the word length and languageid.</documentation>      <input message="tns:AnagramChallengeSoapRequest"/>      <output message="tns:AnagramChallengeSoapResponse"/>    </operation>    <operation name="Anagrams">      <documentation>Randomly get a list of stored anagram words by passing language id and word length. If you pass an empty string for language the random word is language independent. If you pass a zero as length the length compare is not used.</documentation>      <input message="tns:AnagramsSoapRequest"/>      <output message="tns:AnagramsSoapResponse"/>    </operation>    <operation name="CheckSolutions">      <documentation>Test your knowledge. Pass an anagram word, a language id and an array of words to verify. Gets a result set back that contains the number of correct and incorrect words you gave, the solutions stored which you can compare to the number you've passed and per passed anagram word if it was correct or incorrect</documentation>      <input message="tns:CheckSolutionsSoapRequest"/>      <output message="tns:CheckSolutionsSoapResponse"/>    </operation>    <operation name="WordCount">      <documentation>Returns the number of anagram words stored in the system</documentation>      <input message="tns:WordCountSoapRequest"/>      <output message="tns:WordCountSoapResponse"/>    </operation>    <operation name="WordsPerLanguage">      <documentation>Number of anagram words per language. Pass a valid languageid. For a list of languages use the Languages web service function or add one if your language is missing.</documentation>      <input message="tns:WordsPerLanguageSoapRequest"/>      <output message="tns:WordsPerLanguageSoapResponse"/>    </operation>    <operation name="AddLanguage">      <documentation>Add a language to the system, returns added status in a struct. The struct contains True when the language was added, False when there was an error. An explanation text tells what went wrong.</documentation>      <input message="tns:AddLanguageSoapRequest"/>      <output message="tns:AddLanguageSoapResponse"/>    </operation>    <operation name="IsAnagram">      <documentation>Check if the words could be anagrams. Does not store the words, you need to use AddAnagram for that.</documentation>      <input message="tns:IsAnagramSoapRequest"/>      <output message="tns:IsAnagramSoapResponse"/>    </operation>    <operation name="AddAnagram">      <documentation>Add an anagram word pair to the system. Returns a struct with the status of the whole operation. One ore both words may exist. Combinations are created with earlier stored words.</documentation>      <input message="tns:AddAnagramSoapRequest"/>      <output message="tns:AddAnagramSoapResponse"/>    </operation>    <operation name="ListAllAnagrams">      <documentation>Makes a list of all stored anagram words. Pass TRUE if you want to see only one branch for all word combinations</documentation>      <input message="tns:ListAllAnagramsSoapRequest"/>      <output message="tns:ListAllAnagramsSoapResponse"/>    </operation>    <operation name="WordLengths">      <documentation>Get a distinct array of word lengths, you can use one of the values for another service call when iCharacters is possible as argument.</documentation>      <input message="tns:WordLengthsSoapRequest"/>      <output message="tns:WordLengthsSoapResponse"/>    </operation>    <operation name="Copyrights">      <documentation>Returns the Copyrights of this webservice</documentation>      <input message="tns:CopyrightsSoapRequest"/>      <output message="tns:CopyrightsSoapResponse"/>    </operation>  </portType>  <binding name="AnagramServiceSoapBinding" type="tns:AnagramServiceSoapType">    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>    <operation name="Languages">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="AnagramChallenge">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="Anagrams">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="CheckSolutions">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="WordCount">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="WordsPerLanguage">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="AddLanguage">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="IsAnagram">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="AddAnagram">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="ListAllAnagrams">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="WordLengths">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>    <operation name="Copyrights">      <soap:operation soapAction="" style="document"/>      <input>        <soap:body use="literal"/>      </input>      <output>        <soap:body use="literal"/>      </output>    </operation>  </binding>  <service name="AnagramService">    <documentation>Visual DataFlex Web Service. An anagram is a word or phrase formed by reordering the letters of another word or phrase, such as satin to stain. This web service shows functions to test your knowledge about anagrams. There are functions to test if a word is an anagram, how many words are stored etc. Anagrams can be stored in multiple languages. Have fun!</documentation>    <port name="AnagramServiceSoap" binding="tns:AnagramServiceSoapBinding">      <soap:address location="http://webservices.oorsprong.org/websamples.anagram/anagramservice.wso"/>    </port>  </service></definitions>